## Assignment: Student Management Database in PostgreSQL
Objective
In this exercise, you will connect to a PostgreSQL database you created, build the tables for a simple student management system, insert sample data, and perform different queries â€” including JOIN operations.

Part 1: Database Connection
Create a new database in PostgreSQL named student_management.

Write Python code (using psycopg2) to connect to your student_management database.

Example:

In [ ]:
import psycopg2

# Connect to PostgreSQL
conn = psycopg2.connect(
    dbname="student_management",
    user="postgres",
    password="your_password",
    host="localhost",
    # port="5432"
)

cur = conn.cursor()
print("Database connected successfully.")

In [1]:
import psycopg2

conn = psycopg2.connect(
    dbname="student_management",
    user="postgres",
    password="0000",
    host="localhost",
    port="5432"
)

cur = conn.cursor()
print("Database connected successfully.")

Database connected successfully.

## Part 2: Create Tables

Create the following tables using SQL:

### `students`
- `student_id` (SERIAL PRIMARY KEY)  
- `name` (VARCHAR)  
- `email` (VARCHAR)  
- `phone` (VARCHAR)  

### `courses`
- `course_id` (SERIAL PRIMARY KEY)  
- `course_name` (VARCHAR)  
- `credits` (INT)  

### `enrollments`
- `enrollment_id` (SERIAL PRIMARY KEY)  
- `student_id` (INT REFERENCES students(student_id))  
- `course_id` (INT REFERENCES courses(course_id))  
- `grade` (VARCHAR)

## Part 3: Insert Sample Data
Insert at least 3 records into each table.

Example:

In [3]:
# INSERT INTO students (name, email, phone) VALUES
# ('Alice Johnson', 'alice@example.com', '1234567890'),
# ('Bob Smith', 'bob@example.com', '9876543210'),
# ('Charlie Brown', 'charlie@example.com', '5555555555');

# INSERT INTO courses (course_name, credits) VALUES
# ('Mathematics', 3),
# ('Computer Science', 4),
# ('History', 2);

# INSERT INTO enrollments (student_id, course_id, grade) VALUES
# (1, 1, 'A'),
# (1, 2, 'B'),
# (2, 3, 'A'),
# (3, 2, 'C');

## Part 4: Query Tasks

Write SQL queries to answer the following questions:

1. **List all students.**
   ```sql
   SELECT * FROM students;

In [2]:
cur.execute("SELECT * FROM students")
print(cur.fetchall())

[(1, 'amr', 'amr@gmail.com', '1234567890'), (2, 'mina', 'mina@gmail.com', '9876543210'), (3, 'omer', 'omer@gmail.com', '5555555555'), (4, 'nour', 'nour@gmail.com', '5555555555'), (5, 'mostfa', 'mostfa@gmail.com', '5555555555'), (6, 'beshoy', 'beshoy@gmail.com', '5555555555'), (7, 'mohamed', 'mohamed@gmail.com', '5555555555'), (8, 'tadros', 'tadros@gmail.com', '5555555555'), (9, 'naira', 'naira@gmail.com', '5555555555'), (10, 'nardien', 'nardien@gmail.com', '5555555555')]

2. Find students who have a grade of 'A'.
Hint: Use a WHERE clause in the enrollments table to filter by grade.

SELECT * 
FROM enrollments
WHERE grade = 'A';

In [4]:
cur.execute("""
SELECT s.name
FROM students s
JOIN enrollments e ON s.student_id = e.student_id
WHERE e.grade='A'
""")
print(cur.fetchall())

[('amr',), ('mina',), ('nour',), ('beshoy',), ('mohamed',), ('naira',)]

3. Show all courses with their credit hours.
Hint: Select course name and credit hours from the courses table.


SELECT course_name, credit_hours 
FROM courses;

In [5]:
cur.execute("SELECT course_name, credits FROM courses")
print(cur.fetchall())

[('Database Systems', 3), ('Computer Networks', 4), ('Operating Systems', 3), ('Artificial Intelligence', 4), ('Web Development', 2)]

4. Find the courses a specific student (e.g., 'Alice Johnson') is enrolled in.
Hint: Use JOIN between students, enrollments, and courses.


SELECT s.name, c.course_name
FROM students s
JOIN enrollments e ON s.student_id = e.student_id
JOIN courses c ON e.course_id = c.course_id
WHERE s.name = 'Alice Johnson';

In [7]:
cur.execute("""
SELECT s.name, c.course_name
FROM students s
JOIN enrollments e ON s.student_id=e.student_id
JOIN courses c ON e.course_id=c.course_id
WHERE s.name='amr'
""")
print(cur.fetchall())

[('amr', 'Database Systems'), ('amr', 'Computer Networks')]

5. List each student along with the number of courses they are enrolled in.
Hint: Use JOIN, GROUP BY, and COUNT().


SELECT s.name, COUNT(e.course_id) AS total_courses
FROM students s
JOIN enrollments e ON s.student_id = e.student_id
GROUP BY s.name;

In [8]:
cur.execute("""
SELECT s.name, COUNT(e.course_id)
FROM students s
LEFT JOIN enrollments e ON s.student_id=e.student_id
GROUP BY s.name
""")
print(cur.fetchall())

[('nour', 2), ('omer', 2), ('beshoy', 2), ('mostfa', 1), ('mohamed', 1), ('amr', 2), ('tadros', 2), ('mina', 2), ('nardien', 1), ('naira', 1)]

6. Find students who are not enrolled in any course.
Hint: Use LEFT JOIN and check for NULL in the enrollments table.


SELECT s.name
FROM students s
LEFT JOIN enrollments e ON s.student_id = e.student_id
WHERE e.course_id IS NULL;

In [9]:
cur.execute("""
SELECT s.name
FROM students s
LEFT JOIN enrollments e ON s.student_id=e.student_id
WHERE e.course_id IS NULL
""")
print(cur.fetchall())

[]

7. Show all enrollments sorted by grade (highest to lowest).
Hint: Use ORDER BY with DESC.


SELECT * 
FROM enrollments
ORDER BY grade DESC;

In [12]:
cur.execute("""
SELECT s.name, c.course_name, e.grade
FROM enrollments e
JOIN students s ON e.student_id = s.student_id
JOIN courses c ON e.course_id = c.course_id
ORDER BY e.grade DESC
""")

for row in cur.fetchall():
    print(row)

('tadros', 'Database Systems', 'C')
('omer', 'Computer Networks', 'C')
('mostfa', 'Operating Systems', 'C')
('omer', 'Artificial Intelligence', 'B')
('nour', 'Database Systems', 'B')
('nardien', 'Operating Systems', 'B')
('amr', 'Computer Networks', 'B')
('mina', 'Operating Systems', 'B')
('beshoy', 'Computer Networks', 'B')
('tadros', 'Computer Networks', 'B')
('beshoy', 'Artificial Intelligence', 'A')
('mohamed', 'Web Development', 'A')
('mina', 'Database Systems', 'A')
('amr', 'Database Systems', 'A')
('nour', 'Web Development', 'A')
('naira', 'Artificial Intelligence', 'A')

Part 5: Bonus
Write a query to find the average grade per course (Convert grades into numeric values if you want to calculate an average).

Add a instructor table and modify your queries to include instructor names.

In [11]:
cur.execute("""
SELECT c.course_name,
AVG(
CASE
WHEN grade='A' THEN 4
WHEN grade='B' THEN 3
WHEN grade='C' THEN 2
ELSE 1
END) AS avg_grade
FROM enrollments e
JOIN courses c ON e.course_id=c.course_id
GROUP BY c.course_name
""")
print(cur.fetchall())

[('Database Systems', Decimal('3.2500000000000000')), ('Computer Networks', Decimal('2.7500000000000000')), ('Artificial Intelligence', Decimal('3.6666666666666667')), ('Web Development', Decimal('4.0000000000000000')), ('Operating Systems', Decimal('2.6666666666666667'))]

In [13]:
cur.close()
conn.close()
print("Database connection closed.")

Database connection closed.